#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 2501                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: 1104minho <boj.kr/u/1104minho>              +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/2501                           #+#        #+#      #+#     #
#    Solved: 2024/09/19 21:04:48 by 1104minho     ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #


# N의 약수 중 K번째 약수 구하기 없으면 0
N,K = map(int,input().split())

list = []

for i in range(1,N+1):
    if N % i == 0:
        list.append(i)

# 리스트 비어있는지 체크
if len(list) < K:
    print(0)
else :
    print(list[K-1])
