#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 10798                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: 1104minho <boj.kr/u/1104minho>              +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/10798                          #+#        #+#      #+#     #
#    Solved: 2024/09/15 17:11:21 by 1104minho     ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #


# 문자열 저장 배열
array=[]

# 정답용
answer = ""

# 배열에 단어 삽입
for i in range(5):
    array.append(list(input()))



for i in range(15): # 최대 15개 글자들임
    for j in range(5): # 행은 5개로 고정임
        if i < len(array[j]): # 만약 첫번째 행의 길이가 i 보다 작을시 -> 문자를 추가할 수 있는 조건 
            answer += array[j][i]

print(answer)